$(function(){
 
  new gridjs.Grid({
    columns: ["素材名称", "モンスター名称", "弱点属性", "レベル"],
    search: true, // 検索
    sort: true,  // ソート
    pagination: { // ページネーション
      limit: 25
    },
    style: {
      td: {
        border: '1px solid #ccc'
      },
      table: {
        'font-size': '20px'
      }
    },
    data: [
      ["傀異化した骨/堅骨", "アオアシラ", "火", "EX★1"], 
      ["傀異化した骨/堅骨", "ウルクスス", "火", "EX★1"],
      ["傀異化した骨/堅骨", "ラングロトラ", "水", "EX★1"],
      ["傀異化した皮/上皮", "オサイズチ", "雷", "EX★1"],
      ["傀異化した皮/上皮", "ドスフロギィ", "氷", "EX★1"],
      ["傀異化した皮/上皮", "ドスバギィ", "火", "EX★1"],
      ["傀異化した皮/上皮", "クルルヤック", "水", "EX★1"],
      ["傀異化した血/浄血", "ヨツミワドウ", "氷", "EX★2"],
      ["傀異化した血/浄血", "ビシュテンゴ", "氷", "EX★2"],
      ["傀異化した血/浄血", "フルフル", "火", "EX★2"],
      ["傀異化した血/浄血", "ダイミョウザザミ", "雷", "EX★2"],
      ["傀異化した竜骨/堅竜骨", "ロアルドロス", "火", "EX★2"],
      ["傀異化した竜骨/堅竜骨", "ボルボロス", "火", "EX★2"],
      ["傀異化した竜骨/堅竜骨", "バサルモス", "龍", "EX★2"],
      ["傀異化した竜骨/堅竜骨", "アケノシルム", "水", "EX★2"],
      ["傀異化した甲殻/堅殻", "イソネミクニ", "雷", "EX★3"],
      ["傀異化した甲殻/堅殻", "ジュラトドス", "雷", "EX★3"],
      ["傀異化した甲殻/堅殻", "ビシュテンゴ亜種", "水", "EX★3"],
      ["傀異化した甲殻/堅殻", "ショウグンギザミ", "雷", "EX★3"],
      ["傀異化した鱗/上鱗", "リオレイア", "龍", "EX★3"],
      ["傀異化した鱗/上鱗", "プケプケ", "雷", "EX★3"],
      ["傀異化した鱗/上鱗", "トビカガチ", "水", "EX★3"],
      ["傀異化した鱗/上鱗", "アンジャナフ", "水", "EX★3"],
      ["傀異化した爪/尖爪", "オロミドロ", "火", "EX★4"],
      ["傀異化した爪/尖爪", "ヤツカダキ", "氷", "EX★4"],
      ["傀異化した爪/尖爪", "ゴシャハギ", "火", "EX★4"],
      ["傀異化した爪/尖爪", "イソネミクニ亜種", "火", "EX★4"],
      ["傀異化した牙/鋭牙", "ベリオロス", "火", "EX★4"],
      ["傀異化した牙/鋭牙", "ナルガクルガ", "雷", "EX★4"],
      ["傀異化した牙/鋭牙", "ガランゴルム", "雷", "EX★4"],
      ["傀異化した牙/鋭牙", "マガイマガド", "水", "EX★4"],
      ["傀異化した凶鱗", "タマミツネ", "雷", "EX★5"],
      ["傀異化した凶鱗", "リオレウス", "龍", "EX★5"],
      ["傀異化した凶鱗", "ライゼクス", "氷", "EX★5"],
      ["傀異化した凶骨", "ルナガロン", "火", "EX★5"],
      ["傀異化した凶骨", "オロミドロ亜種", "水", "EX★5"],
      ["傀異化した凶骨", "ティガレックス", "雷", "EX★5"],
      ["傀異化した凶角", "セルレギオス", "雷", "EX★5"],
      ["傀異化した凶角", "ディアブロス", "氷", "EX★5"],
      ["傀異化した凶角", "ジンオウガ", "氷", "EX★5"],
    ]
  }).render(document.getElementById("wrapper"));
   
});
